[HoloTargeting X2AbilityTemplate]
LocFriendlyName="全息目标定位"
LocLongDescription="任何定向的<Ability:WeaponName/>射击，无论命中或未命中，都会标记目标，从而增加你的小队针对该目标的瞄准力 +<Ability:HOLOTARGETAIMBONUS/>。"
LocHelpText="射击目标可使友军获得瞄准该目标的奖励"
LocPromotionPopupText="<Bullet/> 定向的 <Ability:WeaponName/> 特定能力将授予全息瞄准。<br/><Bullet/> 任何针对多个单位的 <Ability:ClassName/> 能力都不会授予全息瞄准。<br/>"
LocFlyOverText="全息瞄准"

[BattleScanner X2WeaponTemplate]
FriendlyName="战斗扫描仪"
FriendlyNamePlural="战斗扫描仪"
BriefSummary="战斗扫描仪为战场提供了额外的视野。士兵可以像手榴弹一样部署它，将其扔到他们想要显示的地图上的隐藏区域。任何隐藏或伪装的敌人也将被显示出来。"
TacticalText="<Bullet/>战斗扫描仪可以揭露被"战争迷雾"隐藏数个回合的区域。\n<Bullet/>战斗扫描仪还可以揭露隐藏或伪装的敌人。"
AbilityDescName="霰弹枪"

[ClausMecShotgun_CV_Schematic X2SchematicTemplate]
m_strClassLabel="游侠"
